{
  "fullname": "LOU Chaoli",
  "language": "Language",
  "site": {
    "title": "Chaoli",
    "description": "Personal website of LOU Chaoli. I'm an indie game developer who also loves art, photography and traveling.",
    "home": "Home",
    "work": "Work",
    "games": "Games",
    "art": "Art",
    "photos": "Photos",
    "tools": "Tools",
    "blog": "Blog",
    "about": "About",
    "resume": "Resume",
    "links": "Links",
    "contact": "Contact",
    "notFound": "Page not found",
    "backHome": "Go to homepage"
  },
  "homepage": {
    "heroHeading": "Hey there, I'm LOU Chaoli, an indie game developer.",
    "heroDesc": "I make games, and also love art, photography and travel.",
    "aboutme": "About me",
    "workHeading": "My Work",
    "workSubheading": "Games & Art & Photos",
    "blogHeading": "Blog",
    "blogSubheading": "My Ideas",
    "morePosts": "More Posts",
    "toolsHeading": "Toolbox",
    "toolsSubheading": "Sometimes useful",
    "moreTools": "More Tools"
  },
  "games": {
    "genre": "Genre",
    "platform": "Platform",
    "engine": "Engine",
    "pubDate": "Release date",
    "sessionTime": "Average session",
    "controls": "Inputs",
    "src": "Source",
    "repo": "Code repo",
    "team": "Team",
    "howToPlay": "How To Play",
    "note": "Note",
    "moregames": "More Games",
    "cquHorror": {
      "title": "CQU Horror",
      "desc": "Try to survive in a dangerous campus",
      "action": "Play Now",
      "genre": "Horror, Shooter",
      "session": "About an hour",
      "controls": "Keyboard, Mouse",
      "intro": "Years after graduating from CQU, Cheng You followed his hobby and became a private detective. One day, he receives an anonymous commission letter inviting him to return to his alma mater to investigate a mysterious case. And when Cheng You arrives at the once familiar place, he finds that everything that happens is beyond his imagination...",
      "howTo1": "Use arrow keys to control movement, right mouse button to aim, left mouse button to shoot, middle mouse button to switch weapons, TAB key to open backpack, mouse click to use items.",
      "howTo2": "Find weapons and supplies you need, try to survive in a campus full of mysterious creatures, and find out the truth behind the scenes ......",
      "note1": "This is my first near-complete (though only the first chapter is finished) indie game. This game was initially made as a course project for my game design course in June 2021. My team member ZJX was inspired by the board game Arkham Horror，and had the idea of making a Cthulhu-style horror game where stories happen in a campus. I spent two weeks making and submitting a demo for the game, and then continued development together with ZJX during the summer break, eventually releasing the first chapter of the game.",
      "note2": "The game's art resources were made using Asprite, and the music and sounds were purchased from Audio Jungle. The art style was partly influenced by aarthificial's Astortion game dev logs. In addition, I would like to express special thanks to TKC and YJ for their financial sponsorship.",
      "team": "<0>Chaoli: Coding, Art</0><1>ZJX: Design</1><2>Mr.Haoren: Design</2><3>HYW: Design</3>"
    },
    "sb": {
      "title": "Coin Era",
      "desc": "Play with your friend, and feel the power of money",
      "action": "Download",
      "genre": "Action",
      "session": "5 min",
      "controls": "Keyboard / Gamepad",
      "intro": "From ancient times to modern times, human society has slowly evolved. Money has witnessed the productivity that drives society. In 1P vs. 2P mode, players need to improve their economic factors within 5 minutes to make their own era evolve, and at the end of time, the different evolutionary states of both players may bring different game endings.",
      "howTo1": "According to the key prompt, both players can move, jump, pick up gold coins, store gold coins and throw gold coins. During the game, depending on the era the player is in, different kinds of coins will fall from the sky, you need to seize the opportunity to receive the coins, if you miss and get hit by the coins, you will lose your life. After your life goes down to zero, you will regress back to the previous era and lose half of your wealth, while your opponent's wealth will be doubled. ",
      "howTo2": "After receiving the coins, players can choose to store the coins to increase their wealth, or try to attack or help another player by throwing the coins in their hands. As soon as the wealth reaches a certain threshold, you can move on to the next era. At the end of the game, there will be different endings depending on the era both players are in.",
      "note": "This is my first entry from a game jam (Chongqing College Joint GameJam in early 2022). Our team was named Dubhe Team. The theme of the jam is Treasure. After discussion, our team decided to make a game of picking up coins & throwing them, and further gave it some connotations about human social development.",
      "team": "<0>Megrez: Art, Music</0><1>抱羊羊: Art</1><2>Chaoli: Coding</2><3>枕流: Coding</3><4>蝾螈: Coding</4><5>棂惩: Advisor</5>"
    },
    "intoSoil": {
      "title": "Into Soil",
      "desc": "Play as a tree and put the roots deep into the soil...",
      "action": "Play Now",
      "genre": "Brain Training",
      "session": "5 min",
      "controls": "Mouse",
      "intro": "'As big as a tree's canopy is, its root system is as big as it can be'. the roots of the tree crawl in the ground and grow to a resource-rich place, and the tree will slowly grow.",
      "howTo": "Mouse click to make tree roots grow and fork, collect underground water and mineral resources for growth. Try to plan your route wisely to go deeper.",
      "note": "Entry by Merak Team for Global Game Jam 2023 Hangzhou. the theme of the Jam is 'Roots', so we designed a game to plan the growth path of tree roots. We tried to innovate the art style(Thanks to the Xbr Shader by llapuras) and got a good response after it was published on <0>Bilibili</0>.",
      "team": "<0>Megrez: Art, Music</0><1>汪一二中: Design</1><2>Chaoli: Coding</2><3>Muzeee: Sound</3><4>抱羊羊: Mascot</4>"
    },
    "beltRush": {
      "title": "Belt Rush",
      "desc": "Test your reaction speed by sorting packages!",
      "action": "Play Now",
      "genre": "Casual",
      "session": "3 min",
      "controls": "Mouse / Touch",
      "intro": "In this game, some packages are coming from a conveyor belt, and you need to put them on appropriate belts (match by **COLOR**). Try not to make wrong matches (also if you don’t make a decision in time the package will be dropped into the trash bin) and get fired by the boss. A correct match gives you one score.",
      "howTo": "Click the target belt on the left to put the incoming package.",
      "note": "Entry for 2023 Ludum Dare 53 Jam, also my first time to join Ludum Dare. The jam theme was Deliver, and our team  discussed over and over before making the decision to make a simple package sorting mini-game. Because of the simple control method, it is easy to achieve cross-platform (currently only iOS is not available). The game ended up with an overall rating of 3.989 and a ranking of 186 (see <0>Ludum Dare page</0>). In addition to the team members listed, I would also like to thank 汪一二中 and 枕流 for their help in game design.",
      "team": "<0>Megrez: Art, Menu Music</0><1>Xiu Xiaoqing: Art</1><2>Chaoli: Coding</2><3>Mr. Salamander: Coding</3>"
    },
    "touchex": {
      "title": "地下邮电",
      "desc": "Play an underground eletrician!",
      "action": "Play Now",
      "genre": "Action",
      "session": "5 min",
      "controls": "Keyboard, Mouse",
      "intro": "There is such a group of cute and weird creatures, they live in the dark underground, and need electricity to live. You are a little monster who can safely touch the circuit to conduct electricity! Use your ability to play underground electrician, bring them light and become friends with them!",
      "howTo": "By swinging your body and controlling the grasping of both hands, you will be able to deliver electricity to all corners of the underground world via various cables. Objective of the game: supply power to 3 NPCs living in different areas!",
      "note": "Entry for 2023 CiGA Game Jam Shenzhen Nanshan Station by UMa Team. The theme was Touch. After discussion (until the next morning) we made decisions on the game mechanics. Discarded ideas included: 1. Slime ACT, when on different terrains you get different effects. 2. Multiplayer PONG, where the ball can stick to other balls. The finished product shows a good effect, while there are some flaws: the bug of hand going through the cable, level complexity and other factors lead to greater difficulty.",
      "team": "<0>Megrez: Art</0><1>Xiu Xiaoqing: Art</1><2>Raul7: Design</2><3>Fengbai: Design</3><4>Rapier: Music</4><5>Chaoli: Coding</5>"
    },
    "deadzone": {
      "title": "Dead Zone",
      "desc": "Awesome shooter game",
      "action": "Play Now",
      "genre": "Shooter",
      "session": "5 min",
      "controls": "Keyboard, Mouse",
      "intro": "A large wave of enemies are attacking you. Their deaths will generate impassable Dead Zones. Use your weapon to survive in this dangerous place!",
      "howTo": "Use keyboard WASD to move, left mouse button to shoot, right mouse button to use special skill to clear Dead Zones.",
      "note": "Entry for Ludum Dare 54 Jam. The theme of the jam is Limited Space. The main highlight of the game is artistic innovation: using shader to create dead zone effects.",
      "team": "<0>Megrez: Art</0><1>Chaoli: Coding</1>"
    },
    "poopybird": {
      "title": "Poopy Bird",
      "desc": "Poop poop",
      "action": "Play Now",
      "genre": "Shooter",
      "session": "2 min",
      "controls": "Keyboard+Mouse / Gamepad",
      "intro": "A little bird is starting a hard journey!",
      "howTo": "Use keyboard WASD to move, left mouse button to shoot.",
      "note": "Entry for the Global Game Jam 2024 Beijing Rocketpunch site, where the theme of the jam is Make Me Laugh. As a shit game, it provides a more than stress-relieving game experience.",
      "team": "<0>RabbitKingdom: Design, Art</0><1>Megrez: Art, Music</1><2>ChopWoodFish: Coding</2><3>Chaoli: Coding</3>"
    },
    "crashpunk": {
      "title": "Crash Punk",
      "desc": "Crash them all!",
      "action": "Play Now",
      "genre": "Shooter",
      "session": "3 min",
      "controls": "Keyboard / Gamepad",
      "intro": "Crash them all!",
      "howTo": "Aim (8 directions) with Keyboard WASD or Gamepad Left Stick. Shoot / Accept with Keyboard Space or Gamepad Button South / Right Trigger.",
      "note": "Entry for CiGA Game Jam 2024 Guangzhou Gamker site, where the theme is Limited and Limitedless. It's a super awesome game with techno music!",
      "team": "<0>Megrez: Technical Art</0><1>吕小斩: Technical Audio, Coding</1><2>Chaoli: Coding</2>"
    }
  },
  "tools": {
    "namesFight": {
      "title": "Name Fight"
    },
    "pomodoro": {
      "title": "Pomodoro",
      "start": "Start",
      "pause": "Pause",
      "skip": "Skip",
      "working": "Focus time",
      "break": "Time for a break"
    },
    "unitConverter": {
      "title": "Unit Converter"
    },
    "random": {
      "title": "Random",
      "dice": "Dice",
      "int": "Integer",
      "throw": "Roll Dice",
      "decideHelper": "Help you decide",
      "addBelow": "Add your options below",
      "makeDecide": "Decide!",
      "add": "Add",
      "clear": "Clear",
      "remove": "Remove",
      "optionTip": "Pizza / Sushi"
    },
    "spacecleaner": {
      "title": "Space Cleaner",
      "inputText": "Input Text...",
      "cleanLineBreaks": "Clean Line Breaks",
      "clean": "Clean and Copy"
    },
    "squid": {
      "title": "Squid Detector",
      "detect": "Detect",
      "output": "Is a squid"
    }
  },
  "about": {
    "heading": "I'm LOU Chaoli, an indie game developer from Zhejiang, China.",
    "intro1": "I love programming and creating art. I strongly believe that programming and art can be combined to create endless possibilities, one of which is games. While novels and comics provide a vivid story, games provide the interactivity to make it all feel like being there: imagine walking in a world of your own creation.",
    "intro2": "I'm passionate about creating fun games. In addition, I appreciate beautiful and functional interaction design, high-performance software, and clear and easy-to-maintain code. In my free time, I like to read, draw, photograph, and travel.",
    "iLike": "What I like",
    "hobbies": "<0>Astronomy</0><1>Old buildings</1><2>History</2><3>Spiders</3>",
    "imLearning": "What I'm learning",
    "learning": "<0>Frontend Development</0><1>Spanish</1><2>Piano</2>"
  },
  "resume": {
    "profession": "Student",
    "edu": "Education",
    "edu1": "Chongqing University, Master of Electronic Information",
    "eduTime1": "Expected June 2025",
    "edu2": "Chongqing Univerisity, BSE",
    "eduTime2": "June 2022",
    "skills": "Skills",
    "programLang": "Programming languages",
    "frontend": "Frontend",
    "gamedev": "Gamedev"
  }
}
